Pour permettre au banque de faire face au fraude nous allons mettre place un modèle capable de détecter les fraude par carte de credit

In [1]:
# Ouverture du dataset

import pandas as pd
import numpy as np

data =  pd.read_csv("Mall_Customers.csv")
data.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

Nous allons supprimer la colonne "CustomerID" car elle ne nous sert pas

In [2]:
df = data.drop(["CustomerID"], axis=1)
df

     Gender  Age  Annual Income (k$)  Spending Score (1-100)
0      Male   19                  15                      39
1      Male   21                  15                      81
2    Female   20                  16                       6
3    Female   23                  16                      77
4    Female   31                  17                      40
..      ...  ...                 ...                     ...
195  Female   35                 120                      79
196  Female   45                 126                      28
197    Male   32                 126                      74
198    Male   32                 137                      18
199    Male   30                 137                      83

[200 rows x 4 columns]

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Gender                  200 non-null    object
 1   Age                     200 non-null    int64
 2   Annual Income (k$)      200 non-null    int64
 3   Spending Score (1-100)  200 non-null    int64
dtypes: int64(3), object(1)
memory usage: 6.4+ KB

In [4]:
# Connaitre la taille du dataset
df.shape

(200, 4)

In [5]:
# vérifions si il y a des valeurs manquantes 
df.isna().sum()

Gender                    0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

il n'y a pas de valeurs manquantes dans le dataset

In [6]:
# Encodage de la variable qualitative
df_copy = df
df_quali =  df_copy.select_dtypes(object)
df_quali

     Gender
0      Male
1      Male
2    Female
3    Female
4    Female
..      ...
195  Female
196  Female
197    Male
198    Male
199    Male

[200 rows x 1 columns]

In [10]:
# listes des variables qualitatives et quantitatives 
df_quali = ["Gender"]
df_quanti = ["Age", "Annual Income (k$)", "Spending Score (1-100)"]

In [11]:
# fonction pour encoder la variable qualitative
def encod_var_qualitative(df_copy):
    df_copy['Gender'].replace({'Male': 0, 'Female': 1}, inplace=True)
    return df_copy

In [12]:
data_encoded = encod_var_qualitative(df_copy)
data_encoded

     Gender  Age  Annual Income (k$)  Spending Score (1-100)
0         0   19                  15                      39
1         0   21                  15                      81
2         1   20                  16                       6
3         1   23                  16                      77
4         1   31                  17                      40
..      ...  ...                 ...                     ...
195       1   35                 120                      79
196       1   45                 126                      28
197       0   32                 126                      74
198       0   32                 137                      18
199       0   30                 137                      83

[200 rows x 4 columns]

Notre dataset ne contient plus de variables qualitative car dans Gender la valeur Male equivaut à 0 et Female à 1. l'intégrité des données a été vérifié